Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_sqs_queue.terraform_queue must be replaced
-/+ resource "aws_sqs_queue" "terraform_queue" {
      ~ arn                               = "arn:aws:sqs:us-east-1:213550295809:bruno-atlantis-example-queue" -> (known after apply)
      + deduplication_scope               = (known after apply)
      ~ delay_seconds                     = 90 -> 40
      + fifo_throughput_limit             = (known after apply)
      ~ id                                = "https://sqs.us-east-1.amazonaws.com/213550295809/bruno-atlantis-example-queue" -> (known after apply)
      ~ kms_data_key_reuse_period_seconds = 300 -> (known after apply)
      ~ name                              = "bruno-atlantis-example-queue" -> "devparana-atlantis-example-queue" # forces replacement
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
        tags                              = {
            "Environment" = "production"
        }
      ~ url                               = "https://sqs.us-east-1.amazonaws.com/213550295809/bruno-atlantis-example-queue" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

I am a custom workflow

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.brunorussi.site/lock?id=brunoxd13%252Fatlantis-terraform%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 1 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
